Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.0.21/samha0wb/atdf/ATSAMHA0G14WB.atdf
        <register name="DFLLCTRL" offset="0x24" rw="RW" access="WSYNC" size="2" initval="0x0080" caption="DFLL48M Control">
          <bitfield name="ENABLE" caption="DFLL Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode Selection" mask="0x4"/>
          <bitfield name="STABLE" caption="Stable DFLL Frequency" mask="0x8"/>
          <bitfield name="LLAW" caption="Lose Lock After Wake" mask="0x10"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="CCDIS" caption="Chill Cycle Disable" mask="0x100"/>
          <bitfield name="QLDIS" caption="Quick Lock Disable" mask="0x200"/>
          <bitfield name="BPLCKC" caption="Bypass Coarse Lock" mask="0x400"/>
          <bitfield name="WAITLOCK" caption="Wait Lock" mask="0x800"/>
        </register>
        <register name="DFLLVAL" offset="0x28" rw="RW" access="RSYNC" size="4" initval="0x00000000" caption="DFLL48M Value">
          <bitfield name="FINE" caption="Fine Value" mask="0x3FF"/>
          <bitfield name="COARSE" caption="Coarse Value" mask="0xFC00"/>
          <bitfield name="DIFF" caption="Multiplication Ratio Difference" mask="0xFFFF0000"/>
        </register>
        <register name="DFLLMUL" offset="0x2C" rw="RW" size="4" initval="0x00000000" caption="DFLL48M Multiplier">
          <bitfield name="MUL" caption="DFLL Multiply Factor" mask="0xFFFF"/>
          <bitfield name="FSTEP" caption="Fine Maximum Step" mask="0x3FF0000"/>
          <bitfield name="CSTEP" caption="Coarse Maximum Step" mask="0xFC000000"/>
        </register>
        <register name="DFLLSYNC" offset="0x30" rw="RW" size="1" initval="0x00" caption="DFLL48M Synchronization">
          <bitfield name="READREQ" caption="Read Request" mask="0x80"/>
        </register>
        <register name="BOD33" offset="0x34" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="3.3V Brown-Out Detector (BOD33) Control">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="HYST" caption="Hysteresis" mask="0x4"/>
          <bitfield name="ACTION" caption="BOD33 Action" mask="0x18" values="SYSCTRL_BOD33__ACTION"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="MODE" caption="Operation Mode" mask="0x100"/>
          <bitfield name="CEN" caption="Clock Enable" mask="0x200"/>
          <bitfield name="PSEL" caption="Prescaler Select" mask="0xF000" values="SYSCTRL_BOD33__PSEL"/>
          <bitfield name="LEVEL" caption="BOD33 Threshold Level" mask="0x3F0000"/>
        </register>
        <register name="VREG" offset="0x3C" rw="RW" size="2" initval="0x0000" caption="Voltage Regulator System (VREG) Control">
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="FORCELDO" caption="Force LDO Voltage Regulator" mask="0x2000"/>
        </register>
        <register name="VREF" offset="0x40" rw="RW" size="4" initval="0x00000000" caption="Voltage References System (VREF) Control">
          <bitfield name="TSEN" caption="Temperature Sensor Enable" mask="0x2"/>
          <bitfield name="BGOUTEN" caption="Bandgap Output Enable" mask="0x4"/>
          <bitfield name="CALIB" caption="Bandgap Voltage Generator Calibration" mask="0x7FF0000"/>
        </register>
        <register name="DPLLCTRLA" offset="0x44" rw="RW" size="1" initval="0x80" caption="DPLL Control A">
          <bitfield name="ENABLE" caption="DPLL Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
          <bitfield name="ONDEMAND" caption="On Demand Clock Activation" mask="0x80"/>
        </register>
        <register name="DPLLRATIO" offset="0x48" rw="RW" size="4" initval="0x00000000" caption="DPLL Ratio Control">
          <bitfield name="LDR" caption="Loop Divider Ratio" mask="0xFFF"/>
          <bitfield name="LDRFRAC" caption="Loop Divider Ratio Fractional Part" mask="0xF0000"/>
        </register>
        <register name="DPLLCTRLB" offset="0x4C" rw="RW" size="4" initval="0x00000000" caption="DPLL Control B">
          <bitfield name="FILTER" caption="Proportional Integral Filter Selection" mask="0x3" values="SYSCTRL_DPLLCTRLB__FILTER"/>
          <bitfield name="LPEN" caption="Low-Power Enable" mask="0x4"/>
          <bitfield name="WUF" caption="Wake Up Fast" mask="0x8"/>
          <bitfield name="REFCLK" caption="Reference Clock Selection" mask="0x30" values="SYSCTRL_DPLLCTRLB__REFCLK"/>
          <bitfield name="LTIME" caption="Lock Time" mask="0x700" values="SYSCTRL_DPLLCTRLB__LTIME"/>
          <bitfield name="LBYPASS" caption="Lock Bypass" mask="0x1000"/>
          <bitfield name="DIV" caption="Clock Divider" mask="0x7FF0000"/>
        </register>
        <register name="DPLLSTATUS" offset="0x50" rw="R" size="1" initval="0x00" caption="DPLL Status">
          <bitfield name="LOCK" caption="DPLL Lock Status" mask="0x1"/>
          <bitfield name="CLKRDY" caption="Output Clock Ready" mask="0x2"/>
          <bitfield name="ENABLE" caption="DPLL Enable" mask="0x4"/>
          <bitfield name="DIV" caption="Divider Enable" mask="0x8"/>
        </register>
      </register-group>
      <value-group name="SYSCTRL_XOSC__GAIN">
        <value name="0" caption="2MHz" value="0x0"/>
        <value name="1" caption="4MHz" value="0x1"/>
        <value name="2" caption="8MHz" value="0x2"/>
        <value name="3" caption="16MHz" value="0x3"/>
        <value name="4" caption="30MHz" value="0x4"/>
      </value-group>
      <value-group name="SYSCTRL_OSC8M__FRANGE">
        <value name="0" caption="4 to 6MHz" value="0x0"/>
        <value name="1" caption="6 to 8MHz" value="0x1"/>
        <value name="2" caption="8 to 11MHz" value="0x2"/>
        <value name="3" caption="11 to 15MHz" value="0x3"/>
      </value-group>
      <value-group name="SYSCTRL_OSC8M__PRESC">
        <value name="0" caption="1" value="0x0"/>
        <value name="1" caption="2" value="0x1"/>
        <value name="2" caption="4" value="0x2"/>
        <value name="3" caption="8" value="0x3"/>
      </value-group>
      <value-group name="SYSCTRL_BOD33__ACTION">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RESET" caption="The BOD33 generates a reset" value="0x1"/>
        <value name="INTERRUPT" caption="The BOD33 generates an interrupt" value="0x2"/>
      </value-group>
      <value-group name="SYSCTRL_BOD33__PSEL">
        <value name="DIV2" caption="Divide clock by 2" value="0x0"/>
        <value name="DIV4" caption="Divide clock by 4" value="0x1"/>
        <value name="DIV8" caption="Divide clock by 8" value="0x2"/>
        <value name="DIV16" caption="Divide clock by 16" value="0x3"/>
        <value name="DIV32" caption="Divide clock by 32" value="0x4"/>
        <value name="DIV64" caption="Divide clock by 64" value="0x5"/>
        <value name="DIV128" caption="Divide clock by 128" value="0x6"/>
        <value name="DIV256" caption="Divide clock by 256" value="0x7"/>
        <value name="DIV512" caption="Divide clock by 512" value="0x8"/>
        <value name="DIV1K" caption="Divide clock by 1024" value="0x9"/>
        <value name="DIV2K" caption="Divide clock by 2048" value="0xA"/>
        <value name="DIV4K" caption="Divide clock by 4096" value="0xB"/>
        <value name="DIV8K" caption="Divide clock by 8192" value="0xC"/>
        <value name="DIV16K" caption="Divide clock by 16384" value="0xD"/>
        <value name="DIV32K" caption="Divide clock by 32768" value="0xE"/>
        <value name="DIV64K" caption="Divide clock by 65536" value="0xF"/>
      </value-group>
      <value-group name="SYSCTRL_XOSC__STARTUP">
        <value name="CYCLE1" caption="31 us" value="0"/>
        <value name="CYCLE2" caption="61 us" value="1"/>
        <value name="CYCLE4" caption="122 us" value="2"/>
        <value name="CYCLE8" caption="244 us" value="3"/>
        <value name="CYCLE16" caption="488 us" value="4"/>
        <value name="CYCLE32" caption="977 us" value="5"/>
        <value name="CYCLE64" caption="1953 us" value="6"/>
        <value name="CYCLE128" caption="3906 us" value="7"/>
        <value name="CYCLE256" caption="7813 us" value="8"/>
        <value name="CYCLE512" caption="15625 us" value="9"/>
        <value name="CYCLE1024" caption="31250 us" value="10"/>
        <value name="CYCLE2048" caption="62500 us" value="11"/>
        <value name="CYCLE4096" caption="125000 us" value="12"/>
        <value name="CYCLE8192" caption="250000 us" value="13"/>
        <value name="CYCLE16384" caption="500000 us" value="14"/>
        <value name="CYCLE32768" caption="1000000 us" value="15"/>
      </value-group>
