Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMHA0_DFP/2.0.21/samha0wb/atdf/ATSAMHA0G14WB.atdf
      <value-group name="SystemControl_SCR__SLEEPDEEP">
        <value name="VALUE_0" caption="Sleep" value="0"/>
        <value name="VALUE_1" caption="Deep sleep" value="1"/>
      </value-group>
      <value-group name="SystemControl_SCR__SLEEPONEXIT">
        <value name="VALUE_0" caption="O not sleep when returning to Thread mode" value="0"/>
        <value name="VALUE_1" caption="Enter sleep, or deep sleep, on return from an ISR" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__STKALIGN">
        <value name="VALUE_0" caption="4-byte aligned" value="0"/>
        <value name="VALUE_1" caption="8-byte aligned" value="1"/>
      </value-group>
      <value-group name="SystemControl_CCR__UNALIGN_TRP">
        <value name="VALUE_0" caption="Do not trap unaligned halfword and word accesses" value="0"/>
        <value name="VALUE_1" caption="Trap unaligned halfword and word accesses" value="1"/>
      </value-group>
    </module>
  </modules>
  <pinouts>
    <pinout name="SAMHAxG1xW" caption="SAMHAxG1xW">
      <pin position="1" pad="PA00"/>
      <pin position="2" pad="PA01"/>
      <pin position="3" pad="WDOSC"/>
      <pin position="4" pad="PA03"/>
      <pin position="5" pad="GNDANA"/>
      <pin position="6" pad="VDDANA"/>
      <pin position="7" pad="PB06"/>
      <pin position="8" pad="PB07"/>
      <pin position="9" pad="PB08"/>
      <pin position="10" pad="PB09"/>
      <pin position="11" pad="PA04"/>
      <pin position="12" pad="PA05"/>
      <pin position="13" pad="PA06"/>
      <pin position="14" pad="PA07"/>
      <pin position="15" pad="HSOUT"/>
      <pin position="16" pad="LH"/>
      <pin position="17" pad="CL_15"/>
      <pin position="18" pad="WKIN"/>
      <pin position="19" pad="GND_LIN"/>
      <pin position="20" pad="LIN"/>
      <pin position="21" pad="VS"/>
      <pin position="22" pad="GND"/>
      <pin position="23" pad="PA14"/>
      <pin position="24" pad="PA15"/>
      <pin position="25" pad="PA16"/>
      <pin position="26" pad="PA17"/>
      <pin position="27" pad="PA18"/>
      <pin position="28" pad="PA19"/>
      <pin position="29" pad="PB16"/>
      <pin position="30" pad="PB17"/>
      <pin position="31" pad="PA20"/>
      <pin position="32" pad="PA21"/>
      <pin position="33" pad="VCC"/>
      <pin position="34" pad="GND"/>
      <pin position="35" pad="GNDIO"/>
      <pin position="36" pad="VDDIO"/>
      <pin position="37" pad="PB22"/>
      <pin position="38" pad="EN"/>
      <pin position="39" pad="PA27"/>
      <pin position="40" pad="RESET_N"/>
      <pin position="41" pad="PA28"/>
      <pin position="42" pad="GNDIO"/>
      <pin position="43" pad="VDDCORE"/>
      <pin position="44" pad="VDDIN"/>
      <pin position="45" pad="PA30"/>
      <pin position="46" pad="PA31"/>
      <pin position="47" pad="NRES"/>
      <pin position="48" pad="MODE"/>
      <pin position="DB" pad="GND_B" type="INTERNAL_49"/>
      <pin position="HSIN" pad="PA02" type="INTERNAL_50"/>
      <pin position="NTRIG" pad="PB31" type="INTERNAL_51"/>
      <pin position="RXD" pad="PB23" type="INTERNAL_52"/>
      <pin position="TXD" pad="PB30" type="INTERNAL_53"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>